Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: Files in this folder are indexed in place and never modified. Markdown, plain text, code, and documents (PDF, Word, Excel, PowerPoint, CSV) are supported; YAML frontmatter (`type`, `tags`, …) in markdown is used for filtering.
ko: 이 폴더의 파일은 제자리에서 색인되며 절대 수정되지 않습니다. 마크다운, 일반 텍스트, 코드, 문서(PDF, Word, Excel, PowerPoint, CSV)를 지원하며, 마크다운의 YAML 프런트매터(`type`, `tags` 등)는 필터링에 사용됩니다.
ru: Файлы в этой папке индексируются на месте и никогда не изменяются. Поддерживаются Markdown, обычный текст, код и документы (PDF, Word, Excel, PowerPoint, CSV); YAML-заголовок (`type`, `tags`, …) в Markdown используется для фильтрации.
zh_hans: 此文件夹中的文件将就地建立索引，绝不会被修改。支持 Markdown、纯文本、代码和文档（PDF、Word、Excel、PowerPoint、CSV）；Markdown 中的 YAML frontmatter（`type`、`tags` 等）用于筛选。
zh_hant: 此資料夾中的檔案將就地建立索引，絕不會被修改。支援 Markdown、純文字、程式碼與文件（PDF、Word、Excel、PowerPoint、CSV）；Markdown 中的 YAML frontmatter（`type`、`tags` 等）用於篩選。

source: Files larger than 50 MB are not supported in chat attachments.
ko: 50 MB보다 큰 파일은 채팅 첨부 파일로 지원되지 않습니다.
ru: Файлы размером более 50 MB не поддерживаются во вложениях чата.
zh_hans: 聊天附件不支持大于 50 MB 的文件。
zh_hant: 聊天附件不支持大於 50 MB 的文件。

source: Files larger than 100 MB are not supported. Trim before attaching.
ko: 100 MB보다 큰 파일은 지원되지 않습니다. 첨부하기 전에 자르세요.
ru: Файлы размером более 100 MB не поддерживаются. Перед прикреплением обрежьте.
zh_hans: 不支持大于 100 MB 的文件。请在附加前进行精简。
zh_hant: 不支持大於 100 MB 的文件。請在附加前進行精簡。

source: Files seeded into the plugin directory
ko: 플러그인 디렉터리에 시드된 파일
ru: Файлы добавлены в каталог плагина
zh_hans: 已预置到插件目录中的文件
zh_hant: 已預置到插件目錄中的文件

source: FileVault is off — plaintext storage would not be encrypted at rest. Keep SQLCipher on, or turn on FileVault in System Settings → Privacy & Security.
ko: FileVault가 꺼져 있습니다 — 일반 텍스트 저장소는 유휴 상태에서 암호화되지 않습니다. SQLCipher를 켜둔 상태로 유지하거나, 시스템 설정 → 개인정보 보호 및 보안에서 FileVault를 켜세요.
ru: FileVault отключен — хранилище незашифрованного текста не будет шифроваться при хранении. Оставьте SQLCipher включенным или включите FileVault в настройках системы → Конфиденциальность и безопасность.
zh_hans: 文件保险箱已关闭——明文存储在静态时不会加密。请保持 SQLCipher 开启，或在“系统设置”→“隐私与安全性”中打开文件保险箱。
zh_hant: 文件保險箱已關閉——明文存儲在靜態時不會加密。在「系統設置」→「隱私和安全」中保持SQLCipher打開或打開文件保險箱。

source: FileVault is on — your disk is already encrypted at rest, so plaintext storage stays protected and is the most reliable choice.
ko: FileVault가 켜져 있습니다 — 디스크가 이미 유휴 상태에서 암호화되어 있으므로 일반 텍스트 저장소가 보호된 상태로 유지되며 가장 안정적인 선택입니다.
ru: FileVault включен — ваш диск уже зашифрован, поэтому хранилище незашифрованного текста остается защищенным и является наиболее надежным выбором.
zh_hans: 文件保险箱已打开——你的磁盘在静态时已加密，因此明文存储受到保护，是最可靠的选择。
zh_hant: 文件保險箱已打開——您的磁盤在靜態時已加密，因此明文存儲受到保護，是最可靠的選擇。

source: Fill
ko: 채우기
ru: Наполнять
zh_hans: 填充
zh_hant: 填充

source: Fill these in only for servers that don't advertise OAuth metadata. Both the authorize and token URLs must be set to skip discovery.
ko: OAuth 메타데이터를 광고하지 않는 서버에 대해서만 이 항목을 채우세요. 검색을 건너뛰려면 권한 부여 및 토큰 URL을 모두 설정해야 합니다.
ru: Заполняйте их только для серверов, которые не рекламируют метаданные OAuth. И авторизация, и токен URL должны быть настроены так, чтобы пропускать обнаружение.
zh_hans: 仅为不公布 OAuth 元数据的服务器填写这些内容。必须同时设置授权 URL 和令牌 URL 才能跳过发现过程。
zh_hant: 僅爲不公佈 OAuth 元數據的服務器填寫這些內容。必須同時設置授權 URL 和令牌 URL 才能跳過發現過程。

source: Filter
ko: 필터
ru: Фильтр
zh_hans: 筛选
zh_hant: 篩選

source: Filter by this state
ko: 이 상태로 필터링
ru: Фильтровать по этому штату
zh_hans: 按此状态筛选
zh_hant: 按此狀態篩選

source: Filter:
ko: 필터:
ru: Фильтр:
zh_hans: 筛选：
zh_hant: 篩選：

source: Filters
ko: 필터
ru: Фильтры
zh_hans: 筛选器
zh_hant: 篩選器

source: Filters the Gemini catalog to models that support generateContent.
ko: Gemini 카탈로그를 generateContent를 지원하는 모델로 필터링합니다.
ru: Фильтрует каталог Gemini по моделям, поддерживающимgenerateContent.
zh_hans: 将 Gemini 目录筛选为支持 generateContent 的模型。
zh_hant: 將 Gemini 目錄篩選爲支持 generateContent 的模型。

source: Find in conversation
ko: 대화에서 찾기
ru: Найти в беседе
zh_hans: 在对话中查找
zh_hant: 在對話中查找

source: Find places nearby
ko: 주변 장소 찾기
ru: Найти места поблизости
zh_hans: 查找附近地点
zh_hant: 查找附近地點

source: Finding rooms…
ko: 룸 찾는 중…
ru: Поиск комнат…
zh_hans: 正在查找房间…
zh_hant: 正在尋找房間…

source: Finish later
ko: 나중에 완료
ru: Закончить позже
zh_hans: 稍后完成
zh_hant: 稍後完成

source: Finish Reason
ko: 종료 이유
ru: Причина завершения
zh_hans: 完成原因
zh_hant: 完成原因

source: Finish setup
ko: 설정 완료
ru: Завершить настройку
zh_hans: 完成设置
zh_hant: 完成設置

source: Finish the welcome-credit choice before trying this code.
ko: 이 코드를 사용하기 전에 시작 크레딧 선택을 완료하세요.
ru: Сначала завершите выбор приветственных кредитов, а затем попробуйте этот код.
zh_hans: 请先完成欢迎额度选择，再尝试此代码。
zh_hant: 請先完成歡迎額度選擇，再嘗試此代碼。

source: Finished
ko: 완료됨
ru: Законченный
zh_hans: 已完成
zh_hant: 已完成

source: Finishing up
ko: 마무리 중
ru: Завершение
zh_hans: 即将完成
zh_hant: 即將完成

source: Fit
ko: 맞춤
ru: Соответствовать
zh_hans: 适应
zh_hant: 適應

source: Fix
ko: 수정
ru: Исправить
zh_hans: 修复
zh_hant: 修復

source: Fix or clear the proxy URL in Server settings.
ko: 서버 설정에서 프록시 URL을 수정하거나 지우세요.
ru: Исправьте или очистите прокси URL в настройках сервера.
zh_hans: 修复或清除服务端设置中的代理 URL。
zh_hant: 修復或清除服務器設置中的代理URL。

source: Fix or remove %@, then save Sandbox settings again.
ko: %@을(를) 수정하거나 제거한 후, 샌드박스 설정을 다시 저장하세요.
ru: Исправьте или удалите %@, затем снова сохраните настройки песочницы.
zh_hans: 修复或删除 %@，然后再次保存沙盒设置。
zh_hant: 修復或刪除%@，然後再次保存沙盒設置。

source: Fix ownership or permissions for %1$@, then rerun preflight. For user-owned paths, chmod u+rwX "%2$@" is usually enough.
ko: %1$@의 소유권 또는 권한을 수정한 다음 사전 점검을 다시 실행하세요. 사용자 소유 경로의 경우 보통 chmod u+rwX "%2$@"이면 충분합니다.
ru: Исправьте право собственности или разрешения для %1$@, затем повторно запустите предварительную проверку. Для путей, принадлежащих пользователю, обычно достаточно chmod u+rwX «%2$@».
zh_hans: 修复 %1$@ 的所有权或权限，然后重新运行预检。对于用户拥有的路径，通常 chmod u+rwX “%2$@”就足够了。
zh_hant: 修復%1$@的所有權或權限，然後重新運行預檢。對於用戶擁有的路徑，通常chmod u+rwX "%2$@"就足夠了。

source: Fixed model maximum
ko: 고정 모델 최대값
ru: Фиксированный максимум модели
zh_hans: 固定模型上限
zh_hant: 固定模型上限

source: Flexible (Multi Model)
ko: 유연함 (다중 모델)
ru: Гибкий (несколько моделей)
zh_hans: 灵活（多模型）
zh_hant: 靈活（多模型）

source: Folder
ko: 폴더
ru: Папка
zh_hans: 文件夹
zh_hant: 文件夾

source: Folder not found. Search serves the last indexed state.
ko: 폴더를 찾을 수 없습니다. 검색은 마지막으로 색인된 상태를 사용합니다.
ru: Папка не найдена. Поиск использует последнее проиндексированное состояние.
zh_hans: 未找到文件夹。搜索将使用最后一次建立的索引。
zh_hant: 未找到資料夾。搜尋將使用最後一次建立的索引。

source: Folders of documents your agents can search and read on demand
ko: 에이전트가 필요할 때 검색하고 읽을 수 있는 문서 폴더
ru: Папки с документами, которые ваши агенты могут искать и читать по запросу
zh_hans: 供智能体按需搜索和阅读的文档文件夹
zh_hant: 供代理按需搜尋和閱讀的文件資料夾

source: Follow System Appearance
ko: 시스템 모양 따르기
ru: Следовать системному оформлению
zh_hans: 跟随系统外观
zh_hant: 跟隨系統外觀

source: Follow-Up Model
ko: 후속 질문 모델
ru: Модель для уточняющих вопросов
zh_hans: 追问模型
zh_hant: 追問模型

source: for "%@"
ko: "%@"에 대해
ru: для "%@"
zh_hans: 用于“%@”
zh_hant: 用於「%@」

source: Forget
ko: 잊기
ru: Забывать
zh_hans: 忘记
zh_hant: 忘記

source: Forget memory
ko: 메모리 잊기
ru: Забудь память
zh_hans: 忘记记忆
zh_hant: 忘記記憶

source: Forget Memory?
ko: 메모리를 잊으시겠습니까?
ru: Забыть Память?
zh_hans: 忘记记忆？
zh_hant: 忘記記憶？

source: Forget Redactions in Every Conversation
ko: 모든 대화에서 비식별화 잊기
ru: Забудьте о поправках в каждом разговоре
zh_hans: 忘记每个对话中的脱敏内容
zh_hant: 忘記每個對話中的脫敏內容

source: Forget this project's shared memory
ko: 이 프로젝트의 공유 메모리 삭제
ru: Забыть общую память этого проекта
zh_hans: 忘记此项目的共享记忆
zh_hant: 忘記此專案的共享記憶

source: Format: minute hour day-of-month month day-of-week
ko: 형식: 분 시 일 월 요일
ru: Формат: минуты час день месяца месяц день недели
zh_hans: 格式：分钟 小时 月内日期 月份 星期几
zh_hant: 格式：分鐘 小時 月內日期 月份 星期幾

source: Fraction from 0.10 to 1.00.
ko: 0.10에서 1.00 사이의 소수.
ru: Фракция от 0,10 до 1,00.
zh_hans: 比例值范围为 0.10 到 1.00。
zh_hant: 分數從0.10到1.00。

source: Free disk space could not be proven
ko: 여유 디스크 공간을 증명할 수 없습니다
ru: Свободное место на диске не может быть подтверждено
zh_hans: 可用磁盘空间无法验证
zh_hant: 磁盤空間無法驗證

source: Free disk space on the volume that contains %@, then rerun preflight.
ko: %@이(가) 포함된 볼륨의 디스크 공간을 확보한 후 실행 전 확인(preflight)을 다시 실행하세요.
ru: Освободите дисковое пространство на томе, содержащем %@, затем повторно запустите предварительную проверку.
zh_hans: 释放包含 %@ 的卷中的磁盘空间，然后重新运行预检。
zh_hant: 釋放包含%@的卷中的磁盤空間，然後重新運行預檢。

source: Free, private, and works offline. Uses some memory while it runs.
ko: 무료이고 비공개이며 오프라인에서 작동합니다. 실행되는 동안 약간의 메모리를 사용합니다.
ru: Бесплатно, конфиденциально и работает в автономном режиме. Во время работы использует некоторую память.
zh_hans: 免费、私密且可离线运行。运行时会占用一些内存。
zh_hant: 免費、私密且可離線運行。運行時會佔用一些內存。

source: Frequency
ko: 빈도
ru: Периодичность
zh_hans: 频率
zh_hant: 頻率

source: From File
ko: 파일에서
ru: Из файла
zh_hans: 来自文件
zh_hant: 來自文件

source: From File…
ko: 파일에서…
ru: Из файла…
zh_hans: 从文件…
zh_hant: 從文件…

source: From GitHub
ko: GitHub에서
ru: С GitHub
zh_hans: 来自 GitHub
zh_hant: 來自 GitHub

source: From Link or ID…
ko: 링크 또는 ID에서…
ru: По ссылке или ID…
zh_hans: 从链接或 ID…
zh_hant: 從鏈接或 ID…

source: From MLX registry
ko: MLX 레지스트리에서
ru: Из реестра MLX
zh_hans: 来自 MLX 注册表
zh_hant: 來自 MLX 註冊表

source: From: %@
ko: 발신: %@
ru: От: %@
zh_hans: 来自：%@
zh_hant: 來自：%@

source: Frontier models like Claude, ChatGPT, and more. No setup or API key. Pay as you go.
ko: Claude, ChatGPT 등과 같은 최첨단 모델입니다. 설정이나 API 키가 필요하지 않습니다. 사용한 만큼만 지불하세요.
ru: Пограничные модели, такие как Claude, ChatGPT и другие. Нет настройки или клавиши API. Платите по ходу дела.
zh_hans: Claude、ChatGPT 等前沿模型。无需设置或 API 密钥。按用量付费。
zh_hant: Claude、ChatGPT 等前沿模型。無需設置或 API 密鑰。按用量付費。

source: Full
ko: 전체
ru: Полный
zh_hans: 完整
zh_hant: 完整

source: Full Disk Access
ko: 전체 디스크 접근 권한
ru: Полный доступ к диску
zh_hans: 完全磁盘访问权限
zh_hant: 完全磁盤訪問權限

source: Full Isolation
ko: 전체 격리
ru: Полная изоляция
zh_hans: 完全隔离
zh_hant: 完全隔離

source: Full license texts are available in the linked repositories.
ko: 전체 라이선스 텍스트는 연결된 저장소에서 확인할 수 있습니다.
ru: Полные тексты лицензий доступны в связанных репозиториях.
zh_hans: 完整许可证文本可在链接的仓库中查看。
zh_hant: 完整許可證文本可在鏈接的倉庫中查看。

source: Full precision
ko: 전체 정밀도
ru: Полная точность
zh_hans: 完整精度
zh_hant: 完整精度

source: Fuses the per-token decode graph with MLX compile (+25% measured on Gemma 4 QAT). Takes effect after restarting Osaurus — MLX fixes its compile state at the first model load of the process, so toggling this mid-session cannot turn it on/off live (the setting is saved and applies on next launch). Experimental: kept off by default until the historical model-switch corruption (PR #1173) is root-caused. If model switching misbehaves with this on, turn it off and restart.
ko: 토큰당 디코드 그래프를 MLX 컴파일과 융합합니다(Gemma 4 QAT에서 +25% 측정됨). Osaurus를 다시 시작한 후 적용됩니다 — MLX는 프로세스의 첫 번째 모델 로드 시 컴파일 상태를 고정하므로 세션 중간에 이를 전환해도 실시간으로 켜거나 끌 수 없습니다(설정은 저장되며 다음 실행 시 적용됨). 실험적 기능: 과거의 모델 전환 손상(PR #1173)의 근본 원인이 밝혀질 때까지 기본적으로 꺼져 있습니다. 이 기능을 켠 상태에서 모델 전환이 오작동하는 경우, 기능을 끄고 다시 시작하세요.
ru: Объединяет граф декодирования по токенам с компиляцией MLX (+25% по замерам на Gemma 4 QAT). Вступает в силу после перезапуска Osaurus: MLX фиксирует состояние компиляции при первой загрузке модели в процессе, поэтому переключение в середине сеанса не включает и не отключает режим на лету (настройка сохраняется и применяется при следующем запуске). Экспериментально: по умолчанию выключено, пока не найдена первопричина старого повреждения при переключении моделей (PR #1173). Если переключение моделей с этой настройкой работает неправильно, выключите её и перезапустите приложение.
zh_hans: 将每 Token 的解码图与 MLX 编译融合（在 Gemma 4 QAT 上实测 +25%）。重启 Osaurus 后生效——MLX 会在进程首次加载模型时固定其编译状态，因此会话中途切换此开关无法实时开启或关闭（设置会保存并在下次启动时应用）。实验性功能：在历史遗留的模型切换损坏问题（PR #1173）查明根因之前默认保持关闭。如果开启后模型切换出现异常，请关闭并重启。
zh_hant: 將每標記的解碼圖與 MLX 編譯融合（在 Gemma 4 QAT 上測量提升 +25%）。在重啓 Osaurus 後生效——MLX 在進程首次加載模型時會修復其編譯狀態，因此在會話中途切換此選項無法實時開啓或關閉（設置會被保存並在下次啓動時應用）。實驗性功能：默認關閉，直到歷史模型切換損壞問題（PR #1173）得到根本原因分析。如果在開啓此功能時模型切換出現問題，請關閉並重啓。

source: Future
ko: 미래
ru: Будущее
zh_hans: 未来
zh_hant: 未來

source: Gave up: %@
ko: 포기함: %@
ru: Сдался: %@
zh_hans: 放弃：%@
zh_hant: 放棄：%@

source: Gemini model list
ko: Gemini 모델 목록
ru: Список моделей Близнецов
zh_hans: Gemini 模型列表
zh_hant: Gemini模型列表

source: Gemini models
ko: Gemini 모델
ru: Модели Близнецов
zh_hans: Gemini 模型
zh_hant: Gemini模型

source: General
ko: 일반
ru: Основные
zh_hans: 通用
zh_hant: 通用

source: Generate
ko: 생성
ru: Генерировать
zh_hans: 生成
zh_hant: 生成

source: Generate a cryptographic identity stored securely in your iCloud Keychain and Secure Enclave.
ko: iCloud 키체인 및 Secure Enclave에 안전하게 저장되는 암호화 신원을 생성합니다.
ru: Создайте криптографическую идентификацию, хранящуюся в безопасном месте. в вашей Связке ключей iCloud и Secure Enclave.
zh_hans: 生成一个安全存储在 iCloud 钥匙串和安全隔区中的加密身份。
zh_hant: 生成一個安全存儲在 iCloud 鑰匙串和安全隔區中的加密身份。

source: Generate a fresh AI greeting and quick actions on your Core Model each time you open an empty chat. Off uses your custom greeting. The first generation can feel slow on small models like Foundation.
ko: 빈 채팅을 열 때마다 코어 모델에서 새로운 AI 인사말과 빠른 작업을 생성합니다. 끄면 사용자 지정 인사말을 사용합니다. Foundation과 같은 작은 모델에서는 첫 번째 생성이 느리게 느껴질 수 있습니다.
ru: Создавайте новое приветствие ИИ и быстрые действия в своей базовой модели каждый раз, когда вы открываете пустой чат. Выкл. использует ваше собственное приветствие. Первое поколение может показаться медленным на небольших моделях, таких как Foundation.
zh_hans: 每次打开空白聊天时，都会用你的核心模型生成新的 AI 问候语和快捷操作。关闭后则使用你的自定义问候语。首次生成在 Foundation 等小模型上可能感觉较慢。
zh_hant: 每次打開空白聊天時，都會用您的核心模型生成新的 AI 問候語和快捷操作。關閉後則使用您的自定義問候語。首次生成在 Foundation 等小模型上可能感覺較慢。

source: Generate a key from the Keychain to encrypt new data.
ko: 새 데이터를 암호화하기 위해 키체인에서 키를 생성합니다.
ru: Создайте ключ из цепочки ключей для шифрования новых данных.
zh_hans: 从钥匙串生成密钥以加密新数据。
zh_hant: 從鑰匙串生成密鑰以加密新數據。

source: Generate a key from venice.ai/settings/api.
ko: venice.ai/settings/api에서 키를 생성하세요.
ru: Сгенерируйте ключ из venice.ai/settings/api.
zh_hans: 从 venice.ai/settings/api 生成密钥。
zh_hant: 從 venice.ai/settings/api 生成密鑰。

source: Generate a new 256-bit key and re-encrypt every artifact. The old key is destroyed.
ko: 새로운 256비트 키를 생성하고 모든 아티팩트를 다시 암호화합니다. 이전 키는 파기됩니다.
ru: Создайте новый 256-битный ключ и повторно зашифруйте каждый артефакт. Старый ключ уничтожен.
zh_hans: 生成一个新的 256 位密钥，并重新加密所有制品。旧密钥将被销毁。
zh_hant: 生成一個新的256位密鑰，並重新加密所有文件。舊密鑰將被銷毀。

source: Generate a new 256-bit key and re-encrypt every artifact. The old key is destroyed. Only available while encryption is on.
ko: 새로운 256비트 키를 생성하고 모든 아티팩트를 다시 암호화합니다. 이전 키는 파기됩니다. 암호화가 켜져 있을 때만 사용할 수 있습니다.
ru: Создайте новый 256-битный ключ и повторно зашифруйте каждый артефакт. Старый ключ уничтожен. Доступно только при включенном шифровании.
zh_hans: 生成新的 256 位密钥并重新加密所有制品。旧密钥将被销毁。仅在已启用加密时可用。
zh_hant: 生成新的 256 位密鑰並重新加密所有製品。舊密鑰將被銷毀。僅在已啓用加密時可用。

source: Generate a new API key
ko: 새 API 키 생성
ru: Создайте новый ключ API
zh_hans: 生成一个新的 API 密钥
zh_hant: 生成一個新的API密鑰

source: Generate a title for this chat
ko: 이 채팅의 제목 생성
ru: Сгенерировать название для этого чата
zh_hans: 为此对话生成标题
zh_hant: 為此對話生成標題

source: Generate Access Key
ko: 액세스 키 생성
ru: Создать ключ доступа
zh_hans: 生成访问密钥
zh_hant: 生成訪問密鑰

source: Generate an address for this agent first.
ko: 먼저 이 에이전트의 주소를 생성하세요.
ru: Сначала создайте адрес для этого агента.
zh_hans: 请先为此智能体生成一个地址。
zh_hant: 請先爲此智能體生成一個地址。

source: Generate ideas and explore possibilities
ko: 아이디어를 생성하고 가능성을 탐색합니다
ru: Генерируйте идеи и изучайте возможности
zh_hans: 生成想法并探索可能性
zh_hant: 生成想法並探索可能性

source: Generate ideas, overcome creative blocks, and explore possibilities
ko: 아이디어를 생성하고 창의적인 막힘을 극복하며 가능성을 탐색합니다
ru: Генерируйте идеи, преодолевайте творческие блоки и исследуйте возможности
zh_hans: 生成想法，突破创意瓶颈，并探索各种可能性
zh_hant: 生成想法，突破創意瓶頸，並探索各種可能性

source: Generate Identity
ko: 신원 생성
ru: Создать идентификация
zh_hans: 生成身份
zh_hant: 生成身份

source: Generate insights on a schedule
ko: 일정에 따라 인사이트 생성
ru: Формируйте аналитику по расписанию
zh_hans: 按日程生成洞察
zh_hant: 按日程生成洞察

source: Generate Invite
ko: 초대 생성
ru: Создать приглашение
zh_hans: 生成邀请
zh_hant: 生成邀請

source: Generate Key
ko: 키 생성
ru: Создать ключ
zh_hans: 生成密钥
zh_hant: 生成密鑰

source: Generate one above to share this agent. Past invites appear here so you can revoke them anytime.
ko: 이 에이전트를 공유하려면 위에서 하나를 생성하세요. 과거 초대는 여기에 표시되므로 언제든지 취소할 수 있습니다.
ru: Создайте один из приведенных выше, чтобы поделиться этим агентом. Здесь отображаются прошлые приглашения, поэтому вы можете отозвать их в любое время.
zh_hans: 在上方生成一个以分享此智能体。过往的邀请会显示在此处，以便你随时撤销。
zh_hant: 在上方生成一個以分享此智能體。過往的邀請會顯示在此處，以便你隨時撤銷。

source: Generate text embeddings
ko: 텍스트 임베딩 생성
ru: Создание вложений текста
zh_hans: 生成文本嵌入
zh_hant: 生成文本嵌入

source: Generated pattern
ko: 생성된 패턴
ru: Сгенерированный шаблон
zh_hans: 生成的模式
zh_hant: 生成的模式

source: Generated: %@
ko: 생성됨: %@
ru: Сгенерировано: %@
zh_hans: 已生成：%@
zh_hant: 已生成：%@

source: Generating Title…
ko: 제목 생성 중…
ru: Генерация названия…
zh_hans: 正在生成标题…
zh_hant: 正在生成標題…

source: Generation
ko: 생성
ru: Поколение
zh_hans: 生成
zh_hant: 生成

source: Generation Overrides
ko: 생성 재정의
ru: Переопределения генерации
zh_hans: 生成覆盖
zh_hant: 生成覆蓋

source: Generative Greetings
ko: 생성형 인사말
ru: Генеративные приветствия
zh_hans: 生成式问候
zh_hant: 生成問候

source: Get a daily summary every morning
ko: 매일 아침 일일 요약 받기
ru: Получайте ежедневную сводку каждое утро
zh_hans: 每天早上获取每日摘要
zh_hant: 每天早上獲取每日摘要

source: Get a free key from Google AI Studio.
ko: Google AI Studio에서 무료 키를 받으세요.
ru: Получите бесплатный ключ от Google ИИ Studio.
zh_hans: 从 Google AI Studio 获取免费密钥。
zh_hant: 從 Google AI Studio 獲取免費密鑰。

source: Get a key from console.mistral.ai.
ko: console.mistral.ai에서 키를 받으세요.
ru: Получите ключ с console.mistral.ai.
zh_hans: 从 console.mistral.ai 获取密钥。
zh_hant: 從 console.mistral.ai 獲取密鑰。

source: Get a key from console.x.ai.
ko: console.x.ai에서 키를 받으세요.
ru: Получите ключ с console.x.ai.
zh_hans: 从 console.x.ai 获取密钥。
zh_hant: 從 console.x.ai 獲取密鑰。

source: Get a key from platform.deepseek.com.
ko: platform.deepseek.com에서 키를 받으세요.
ru: Получите ключ на платформе.deepseek.com.
zh_hans: 从 platform.deepseek.com 获取密钥。
zh_hant: 從 platform.deepseek.com 獲取密鑰。

source: Get a key from platform.minimax.io.
ko: platform.minimax.io에서 키를 받으세요.
ru: Получите ключ с сайта Platform.minimax.io.
zh_hans: 从 platform.minimax.io 获取密钥。
zh_hant: 從 platform.minimax.io 獲取密鑰。

source: Get Key
ko: 키 받기
ru: Получить ключ
zh_hans: 获取密钥
zh_hant: 獲取密鑰

source: Get Started
ko: 시작하기
ru: Начать
zh_hans: 开始使用
zh_hant: 開始使用

source: Getting Osaurus Cloud ready…
ko: Osaurus Cloud 준비 중…
ru: Подготовка Osaurus Cloud…
zh_hans: 正在准备 Osaurus Cloud…
zh_hant: 正在準備 Osaurus Cloud…

source: GGUF-only bundle
ko: GGUF 전용 번들
ru: Пакет только GGUF
zh_hans: 仅限 GGUF 的捆绑包
zh_hant: 僅限GGUF的捆綁包

source: Git Commit
ko: Git 커밋
ru: Git-коммит
zh_hans: Git 提交
zh_hant: Git提交

source: GitHub connected
ko: GitHub 연결됨
ru: GitHub подключён
zh_hans: 已连接 GitHub
zh_hant: 已連接 GitHub

source: GitHub limits how often this app can browse and update plugins before it starts showing errors. Connecting a free GitHub account raises that limit so updates keep working.
ko: GitHub는 오류가 나타나기 전까지 이 앱이 플러그인을 탐색하고 업데이트할 수 있는 횟수를 제한합니다. 무료 GitHub 계정을 연결하면 이 한도가 늘어나 업데이트가 계속 작동합니다.
ru: GitHub ограничивает, как часто это приложение может просматривать и обновлять плагины, прежде чем начнут появляться ошибки. Подключение бесплатного аккаунта GitHub повышает этот лимит, чтобы обновления продолжали работать.
zh_hans: GitHub 会限制此应用浏览和更新插件的频率，超出后就会报错。连接一个免费的 GitHub 账户可以提高该限制，让更新持续可用。
zh_hant: GitHub 會限制此應用程式瀏覽和更新插件程式的頻率，超出後就會出現錯誤。連接一個免費的 GitHub 帳戶可以提高該限制，讓更新持續可用。

source: GitHub limits how often this app can check for updates. Connect a free GitHub account to update plugins without hitting that limit.
ko: GitHub는 이 앱이 업데이트를 확인할 수 있는 횟수를 제한합니다. 무료 GitHub 계정을 연결하면 이 한도에 걸리지 않고 플러그인을 업데이트할 수 있습니다.
ru: GitHub ограничивает, как часто это приложение может проверять обновления. Подключите бесплатный аккаунт GitHub, чтобы обновлять плагины, не достигая этого лимита.
zh_hans: GitHub 会限制此应用检查更新的频率。连接一个免费的 GitHub 账户，即可更新插件而不触及该限制。
zh_hant: GitHub 會限制此應用程式檢查更新的頻率。連接一個免費的 GitHub 帳戶，即可更新插件程式而不觸及該限制。

source: GitHub rate limit reached
ko: GitHub 속도 제한에 도달했습니다
ru: Достигнут предел скорости GitHub
zh_hans: 已达到 GitHub 速率限制
zh_hant: 已達到 GitHub 速率限制

source: Give the agent a tool it can call to read a reply aloud when you ask. For always-speak, use Auto Speak Responses in the Voice section.
ko: 요청 시 에이전트가 답변을 소리 내어 읽을 수 있도록 호출할 수 있는 도구를 제공합니다. 항상 말하게 하려면 음성 섹션에서 답변 자동 말하기를 사용하세요.
ru: Предоставьте агенту инструмент, который он сможет вызвать, чтобы прочитать вслух ответ, когда вы спросите. Чтобы всегда говорить, используйте автоматическое проговаривание ответов в разделе «Голос».
zh_hans: 给智能体一个它可以调用的工具，在你要求时朗读回复。如需始终朗读，请在“语音”部分使用“自动朗读回复”。
zh_hant: 當您提問時，給智能體一個它可以調用的工具來朗讀回復。如需始終朗讀，請在語音部分使用「自動朗讀回復」。

source: Give the agent a tool to drive macOS apps via the accessibility tree — clicking, typing, and reading on-screen content. Reads and navigation run automatically; edits and anything consequential pause for your approval.
ko: 접근성 트리를 통해 macOS 앱을 구동할 수 있는 도구를 에이전트에 제공합니다 — 화면 내용 클릭, 입력 및 읽기. 읽기 및 탐색은 자동으로 실행되며, 편집 및 결과에 영향을 미치는 모든 작업은 승인을 위해 일시 중지됩니다.
ru: Предоставьте агенту инструмент для управления приложениями macOS через дерево специальных возможностей — щелкая, вводя и читая содержимое на экране. Чтение и навигация выполняются автоматически; правки и все, что связано с ними, приостанавливаются на ваше одобрение.
zh_hans: 给予智能体一个工具，通过辅助功能树来控制 macOS 应用程序——点击、输入和读取屏幕内容。读取和导航操作会自动运行，但编辑和任何重要操作则会暂停，等待你的批准。
zh_hant: 給予智能體一個工具，通過輔助功能樹來控制 macOS 應用程序——點擊、輸入和讀取屏幕內容。讀取和導航操作會自動運行，但編輯和任何重要操作則會暫停，等待您的批准。

source: Give the assistant ambient awareness of what you're working on. When on, Osaurus freezes a quick snapshot of your open windows and the field you're focused on at the start of each chat, and shares it as background context. It's built from on-screen text only — no screenshots — and is scrubbed by the Privacy Filter before it reaches a cloud model.
ko: 작업 중인 내용에 대한 주변 인식(ambient awareness)을 어시스턴트에게 제공합니다. 켜져 있으면 Osaurus는 각 채팅이 시작될 때 열려 있는 창과 초점을 맞춘 필드의 빠른 스냅샷을 고정하고 이를 배경 컨텍스트로 공유합니다. 화면의 텍스트로만 구성되며 스크린샷은 포함되지 않으며, 클라우드 모델에 도달하기 전에 개인정보 필터에 의해 비식별화됩니다.
ru: Дайте помощнику представление о том, над чем вы работаете. Если эта опция включена, Osaurus замораживает быстрый снимок открытых окон и поля, на котором вы сосредоточены, в начале каждого чата и передает его в качестве фонового контекста. Он состоит только из экранного текста (без снимков экрана) и очищается фильтром конфиденциальности, прежде чем достигнет облачной модели.
zh_hans: 让助手获得你正在处理内容的环境感知。开启后，Osaurus 会在每次对话开始时，快速捕捉你打开的窗口与当前聚焦的输入框，定格为一帧快照，并将其作为背景上下文传给助手。该快照仅提取屏幕文字，不含截图，并会在发送给云端模型前先经隐私过滤器脱敏。
zh_hant: 讓助手獲得你正在處理內容的環境感知。開啓後，Osaurus 會在每次對話開始時，快速捕捉你打開的窗口與當前聚焦的輸入框，定格爲一幀快照，並將其作爲背景上下文傳給助手。該快照僅提取屏幕文字，不含截圖，並會在發送給雲端模型前經隱私過濾器清洗。

source: Give this agent a private encrypted database to remember structured data across runs.
ko: 실행 간에 구조화된 데이터를 기억할 수 있도록 이 에이전트에 비공개 암호화된 데이터베이스를 제공합니다.
ru: Выдайте агенту отдельную зашифрованную базу данных, чтобы он сохранял структурированные данные между запусками.
zh_hans: 为此智能体提供一个私有的加密数据库，以便跨多次运行记住结构化数据。
zh_hant: 爲此智能體提供一個私有的加密數據庫，以便跨多次運行記住結構化數據。

source: Give your dino a brain
ko: 공룡에게 두뇌를 제공하세요
ru: Выберите модель для динозавра
zh_hans: 给你的小恐龙一个大脑
zh_hant: 給你的小恐龍一個大腦

source: Glass
ko: 유리
ru: Стекло
zh_hans: 毛玻璃
zh_hant: 玻璃

source: Glass effects use behind-window blur and additional compositing layers. This may impact performance, especially on older Macs or under heavy load.
ko: 유리 효과는 창 뒤의 흐림 효과(blur)와 추가적인 합성 레이어를 사용합니다. 이는 특히 구형 Mac이나 과부하 상태에서 성능에 영향을 미칠 수 있습니다.
ru: Эффекты стекла используют размытие за окном и дополнительные слои композитинга. Это может повлиять на производительность, особенно на старых компьютерах Mac или при большой нагрузке.
zh_hans: 玻璃效果会使用窗口后方模糊和额外的合成图层。这可能会影响性能，尤其是在较旧的 Mac 上或高负载情况下。
zh_hant: 玻璃效果會使用窗口後方模糊和額外的合成圖層。這可能會影響性能，尤其是在較舊的 Mac 上或高負載情況下。
